tiborsimon/embedded-tdd-headers/pic/8bit/pic18f8722_tdd.h
#define A16                           522
#define PORTH_RH1                     523
#define A17                           524
#define PORTH_RH2                     525
#define A18                           526
#define PORTH_RH3                     527
#define A19                           528
#define PORTH_RH4                     529
#define CCP9                          530
#define PORTH_P3C                     531
#define PC3                           532
#define AN12                          533
#define PORTH_RH5                     534
#define CCP8                          535
#define PB3                           536
#define PORTH_P3B                     537
#define AN13                          538
#define PORTH_RH6                     539
#define CCP7                          540
#define PORTH_P1C                     541
#define PC1                           542
#define AN14                          543
#define PORTH_RH7                     544
#define CCP6                          545
#define PB1                           546
#define PORTH_P1B                     547
#define AN15                          548
#define PORTJ                         549
#define ALE                           550
#define PORTJ_RJ0                     551
#define nOE                           552
#define NOT_OE                        553
#define OE                            554
#define PORTJ_RJ1                     555
#define NOT_WRL                       556
#define nWRL                          557
#define WRL                           558
#define PORTJ_RJ2                     559
#define NOT_WRH                       560
#define nWRH                          561
#define WRH                           562
#define PORTJ_RJ3                     563
#define BA0                           564
#define PORTJ_RJ4                     565
#define NOT_CE                        566
#define nCE                           567
#define CE                            568
#define PORTJ_RJ5                     569
#define LB                            570
#define nLB                           571
#define NOT_LB                        572
#define PORTJ_RJ6                     573
#define NOT_UB                        574
#define nUB                           575
#define PORTJ_RJ7                     576
#define UB                            577
#define LATA                          578
#define LATA0                         579
#define LA0                           580
#define LATA1                         581
#define LA1                           582
#define LATA2                         583
#define LA2                           584
#define LATA3                         585
#define LA3                           586
#define LATA4                         587
#define LA4                           588
#define LATA5                         589
#define LA5                           590
#define LATA6                         591
#define LA6                           592
#define LATA7                         593
#define LA7                           594
#define LATB                          595
#define LB0                           596
#define LATB0                         597
#define LB1                           598
#define LATB1                         599
#define LB2                           600
#define LATB2                         601
#define LB3                           602
#define LATB3                         603
#define LB4                           604
#define LATB4                         605
#define LB5                           606
#define LATB5                         607
#define LB6                           608
#define LATB6                         609
#define LB7                           610
#define LATB7                         611
#define LATC                          612
#define LATC0                         613
#define LC0                           614
#define LATC1                         615
#define LC1                           616
#define LATC2                         617
#define LC2                           618
#define LATC3                         619
#define LC3                           620
#define LATC4                         621
#define LC4                           622
#define LATC5                         623
#define LC5                           624
#define LATC6                         625
#define LC6                           626
#define LATC7                         627
#define LC7                           628
#define LATD                          629
#define LATD0                         630
#define LD0                           631
#define LATD1                         632
#define LD1                           633
#define LATD2                         634
#define LD2                           635
#define LATD3                         636
#define LD3                           637
#define LATD4                         638
#define LD4                           639
#define LATD5                         640
#define LD5                           641
#define LATD6                         642
#define LD6                           643
#define LATD7                         644
#define LD7                           645
#define LATE                          646
#define LATE0                         647
#define LE0                           648
#define LATE1                         649
#define LE1                           650
#define LATE2                         651
#define LE2                           652
#define LATE3                         653
#define LE3                           654
#define LATE4                         655
#define LE4                           656
#define LATE5                         657
#define LE5                           658
#define LATE6                         659
#define LE6                           660
#define LATE7                         661
#define LE7                           662
#define LATF                          663
#define LATF0                         664
#define LF0                           665
#define LATF1                         666
#define LF1                           667
#define LF2                           668
#define LATF2                         669
#define LF3                           670
#define LATF3                         671
#define LF4                           672
#define LATF4                         673
#define LF5                           674
#define LATF5                         675
#define LF6                           676
#define LATF6                         677
#define LF7                           678
#define LATF7                         679
#define LATG                          680
#define LATG0                         681
#define LG0                           682
#define LATG1                         683
#define LG1                           684
#define LATG2                         685
#define LG2                           686
#define LATG3                         687
#define LG3                           688
#define LATG4                         689
#define LG4                           690
#define LATG5                         691
#define LATH                          692
#define LH0                           693
#define LATH0                         694
#define LH1                           695
#define LATH1                         696
#define LH2                           697
#define LATH2                         698
#define LH3                           699
#define LATH3                         700
#define LH4                           701
#define LATH4                         702
#define LH5                           703
#define LATH5                         704
#define LH6                           705
#define LATH6                         706
#define LH7                           707
#define LATH7                         708
#define LATJ                          709
#define LATJ0                         710
#define LJ0                           711
#define LATJ1                         712
#define LJ1                           713
#define LATJ2                         714
#define LJ2                           715
#define LATJ3                         716
#define LJ3                           717
#define LATJ4                         718
#define LJ4                           719
#define LATJ5                         720
#define LJ5                           721
#define LATJ6                         722
#define LJ6                           723
#define LATJ7                         724
#define LJ7                           725
#define TRISA                         726
#define TRISA0                        727
#define TRISA_RA0                     728
#define TRISA1                        729
#define TRISA_RA1                     730
#define TRISA2                        731
#define TRISA_RA2                     732
#define TRISA3                        733
#define TRISA_RA3                     734
#define TRISA_RA4                     735
#define TRISA4                        736
#define TRISA_RA5                     737
#define TRISA5                        738
#define TRISA_RA6                     739
#define TRISA6                        740
#define TRISA_RA7                     741
#define TRISA7                        742
#define TRISB                         743
#define TRISB_RB0                     744
#define TRISB0                        745
#define TRISB_RB1                     746
#define TRISB1                        747
#define TRISB_RB2                     748
#define TRISB2                        749
#define TRISB_RB3                     750
#define TRISB3                        751
#define TRISB_RB4                     752
#define TRISB4                        753
#define TRISB_RB5                     754
#define TRISB5                        755
#define TRISB_RB6                     756
#define TRISB6                        757
#define TRISB_RB7                     758
#define TRISB7                        759
#define TRISC                         760
#define TRISC0                        761
#define TRISC_RC0                     762
#define TRISC1                        763
#define TRISC_RC1                     764
#define TRISC2                        765
#define TRISC_RC2                     766
#define TRISC3                        767
#define TRISC_RC3                     768
#define TRISC4                        769
#define TRISC_RC4                     770
#define TRISC5                        771
#define TRISC_RC5                     772
#define TRISC6                        773
#define TRISC_RC6                     774
#define TRISC7                        775
#define TRISC_RC7                     776
#define TRISD                         777
#define TRISD_RD0                     778
#define TRISD0                        779
#define TRISD_RD1                     780
#define TRISD1                        781
#define TRISD_RD2                     782
#define TRISD2                        783
#define TRISD_RD3                     784
#define TRISD3                        785
#define TRISD_RD4                     786
#define TRISD4                        787
#define TRISD_RD5                     788
#define TRISD5                        789
#define TRISD_RD6                     790
#define TRISD6                        791
#define TRISD_RD7                     792
#define TRISD7                        793
#define TRISE                         794
#define TRISE_RE0                     795
#define TRISE0                        796
#define TRISE1                        797
#define TRISE_RE1                     798
#define TRISE2                        799
#define TRISE_RE2                     800
#define TRISE_RE3                     801
#define TRISE3                        802
#define TRISE_RE4                     803
#define TRISE4                        804
#define TRISE_RE5                     805
#define TRISE5                        806
#define TRISE_RE6                     807
#define TRISE6                        808
#define TRISE_RE7                     809
#define TRISE7                        810
#define TRISF                         811
#define TRISF0                        812
#define TRISF_RF0                     813
#define TRISF_RF1                     814
#define TRISF1                        815
#define TRISF_RF2                     816
#define TRISF2                        817
#define TRISF3                        818
#define TRISF_RF3                     819
#define TRISF_RF4                     820
#define TRISF4                        821
#define TRISF_RF5                     822
#define TRISF5                        823
#define TRISF_RF6                     824
#define TRISF6                        825
#define TRISF7                        826
#define TRISF_RF7                     827
#define TRISG                         828
#define TRISG0                        829
#define TRISG_RG0                     830
#define TRISG1                        831
#define TRISG_RG1                     832
#define TRISG2                        833
#define TRISG_RG2                     834
#define TRISG_RG3                     835
#define TRISG3                        836
#define TRISG4                        837
#define TRISG_RG4                     838
#define TRISH                         839
#define TRISH_RH0                     840
#define TRISH0                        841
#define TRISH_RH1                     842
#define TRISH1                        843
#define TRISH_RH2                     844
#define TRISH2                        845
#define TRISH_RH3                     846
#define TRISH3                        847
#define TRISH_RH4                     848
#define TRISH4                        849
#define TRISH_RH5                     850
#define TRISH5                        851
#define TRISH_RH6                     852
#define TRISH6                        853
#define TRISH_RH7                     854
#define TRISH7                        855
#define TRISJ                         856
#define TRISJ_RJ0                     857
#define TRISJ0                        858
#define TRISJ_RJ1                     859
#define TRISJ1                        860
#define TRISJ_RJ2                     861
#define TRISJ2                        862
#define TRISJ_RJ3                     863
#define TRISJ3                        864
#define TRISJ_RJ4                     865
#define TRISJ4                        866
#define TRISJ_RJ5                     867
#define TRISJ5                        868
#define TRISJ_RJ6                     869
#define TRISJ6                        870
#define TRISJ_RJ7                     871
#define TRISJ7                        872
#define OSCTUNE                       873
#define TUN0                          874
#define TUN                           875
#define TUN1                          876
#define TUN2                          877
#define TUN3                          878
#define TUN4                          879
#define PLLEN                         880
#define INTSRC                        881
#define MEMCON                        882
#define WM                            883
#define WM0                           884
#define WM1                           885
#define WAIT0                         886
#define WAIT                          887
#define WAIT1                         888
#define EBDIS                         889
#define PIE1                          890
#define TMR1IE                        891
#define TMR2IE                        892
#define CCP1IE                        893
#define SSP1IE                        894
#define SSPIE                         895
#define TXIE                          896
#define TX1IE                         897
#define RC1IE                         898
#define RCIE                          899
#define ADIE                          900
#define PSPIE                         901
#define PIR1                          902
#define TMR1IF                        903
#define TMR2IF                        904
#define CCP1IF                        905
#define SSPIF                         906
#define SSP1IF                        907
#define TXIF                          908
#define TX1IF                         909
#define RCIF                          910
#define RC1IF                         911
#define ADIF                          912
#define PSPIF                         913
#define IPR1                          914
#define TMR1IP                        915
#define TMR2IP                        916
#define CCP1IP                        917
#define SSPIP                         918
#define SSP1IP                        919
#define TX1IP                         920
#define TXIP                          921
#define RCIP                          922
#define RC1IP                         923
#define ADIP                          924
#define PSPIP                         925
#define PIE2                          926
#define CCP2IE                        927
#define TMR3IE                        928
#define HLVDIE                        929
#define LVDIE                         930
#define BCL1IE                        931
#define BCLIE                         932
#define EEIE                          933
#define CMIE                          934
#define OSCFIE                        935
#define PIR2                          936
#define CCP2IF                        937
#define TMR3IF                        938
#define HLVDIF                        939
#define LVDIF                         940
#define BCL1IF                        941
#define BCLIF                         942
#define EEIF                          943
#define CMIF                          944
#define OSCFIF                        945
#define IPR2                          946
#define CCP2IP                        947
#define TMR3IP                        948
#define HLVDIP                        949
#define LVDIP                         950
#define BCLIP                         951
#define BCL1IP                        952
#define EEIP                          953
#define CMIP                          954
#define OSCFIP                        955
#define PIE3                          956
#define CCP3IE                        957
#define RXB0IE                        958
#define RXBNIE                        959
#define RXB1IE                        960
#define CCP4IE                        961
#define TXB0IE                        962
#define CCP5IE                        963
#define TXB1IE                        964
#define TMR4IE                        965
#define TXB2IE                        966
#define TXBNIE                        967
#define TX2IE                         968
#define RC2IE                         969
#define BCL2IE                        970
#define SSP2IE                        971
#define PIR3                          972
#define CCP3IF                        973
#define RXBNIF                        974
#define CCP4IF                        975
#define CCP5IF                        976
#define TMR4IF                        977
#define TXBNIF                        978
#define TX2IF                         979
#define RC2IF                         980
#define BCL2IF                        981
#define SSP2IF                        982
#define IPR3                          983
#define CCP3IP                        984
#define CCP4IP                        985
#define RXBNIP                        986
#define CCP5IP                        987
#define TMR4IP                        988
#define TX2IP                         989
#define TXBNIP                        990
#define RC2IP                         991
#define BCL2IP                        992
#define SSP2IP                        993
#define EECON1                        994
#define EECON1_RD                     995
#define EECON1_WR                     996
#define WREN                          997
#define WRERR                         998
#define FREE                          999
#define CFGS                          1000
#define EEFS                          1001
#define EEPGD                         1002
#define RCSTA1                        1003
#define RCSTA1_RX9D                   1004
#define RX9D1                         1005
#define RCSTA1_RCD8                   1006
#define RCSTA1_OERR                   1007
#define OERR1                         1008
#define RCSTA1_FERR                   1009
#define FERR1                         1010
#define RCSTA1_ADDEN                  1011
#define ADDEN1                        1012
#define RCSTA1_CREN                   1013
#define CREN1                         1014
#define SRENA                         1015
#define SREN1                         1016
#define RCSTA1_SREN                   1017
#define RCSTA1_NOT_RC8                1018
#define RCSTA1_RC9                    1019
#define RCSTA1_nRC8                   1020
#define RCSTA1_RC8_9                  1021
#define RCSTA1_RX9                    1022
#define RX91                          1023
#define RCSTA1_SPEN                   1024
#define SPEN1                         1025
#define TXSTA1                        1026
#define TX9D1                         1027
#define TXSTA1_TX9D                   1028
#define TXSTA1_TXD8                   1029
#define TRMT1                         1030
#define TXSTA1_TRMT                   1031
#define BRGH1                         1032
#define TXSTA1_BRGH                   1033
#define TXSTA1_SENDB                  1034
#define SENDB1                        1035
#define TXSTA1_SYNC                   1036
#define SYNC1                         1037
#define TXEN1                         1038
#define TXSTA1_TXEN                   1039
#define TX91                          1040
#define TXSTA1_NOT_TX8                1041
#define TXSTA1_TX8_9                  1042
#define TXSTA1_TX9                    1043
#define TXSTA1_nTX8                   1044
#define TXSTA1_CSRC                   1045
#define CSRC1                         1046
#define PSPCON                        1047
#define PSPMODE                       1048
#define IBOV                          1049
#define OBF                           1050
#define IBF                           1051
#define T3CON                         1052
#define TMR3ON                        1053
#define TMR3CS                        1054
#define nT3SYNC                       1055
#define NOT_T3SYNC                    1056
#define T3SYNC                        1057
#define T3INSYNC                      1058
#define SOSCEN3                       1059
#define T3CCP1                        1060
#define T3CKPS                        1061
#define T3CKPS0                       1062
#define T3CKPS1                       1063
#define T3CCP2                        1064
#define T3CON_RD16                    1065
#define RD163                         1066
#define T3RD16                        1067
#define CMCON                         1068
#define CM                            1069
#define CMEN0                         1070
#define CM0                           1071
#define CMEN1                         1072
#define CM1                           1073
#define CMEN2                         1074
#define CM2                           1075
#define CIS                           1076
#define C1INV                         1077
#define C2INV                         1078
#define CMCON_C1OUT                   1079
#define CMCON_C2OUT                   1080
#define CVRCON                        1081
#define CVR                           1082
#define CVR0                          1083
#define CVR1                          1084
#define CVR2                          1085
#define CVR3                          1086
#define CVRSS                         1087
#define CVRR                          1088
#define CVROEN                        1089
#define CVROE                         1090
